Revit 2027 API
ConnectionValidationWarning Methods
The ConnectionValidationWarning type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParts |  Get ElementIds of affected parts.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace